#### DocumentDifference Members

---

|  |
| --- |
| DocumentDifference Class   Methods   Properties   See Also |

The  DocumentDifference  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DocumentDifference |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCreatedElementIds | Created element id collection. |
| Public method | GetDeletedElementIds | Deleted element id collection. For non-worksharing models, this will always be an empty collection. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetModifiedElementIds | Modified element id collection. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AreDeletedElementIdsAvailable | Whether or the deleted elements were retrieved. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DocumentDifference Class

Autodesk.Revit.DB Namespace